#+title: Wstęp do informatyki wyklad05 dynamiczna alokacja pamięci

#+begin_src cpp :exports all
#include <iostream>

int main()
{
    int B[4] = {0,1,2,3};
    int* A = B;
    int** P = &A;
    int*** Q = &P;
    *(*P+1) = 5;
    std::cout << B[1];
    return 0;
}
#+end_src

#+RESULTS:
: 5

#+begin_src cpp
void foo(int A); //foo(B);

void foo(int& A); //foo(B);

void foo(int* A); //foo(&B);

void foo(const int A); //foo(B);
void foo(const int& A); //foo(B);
void foo(const int* A); //foo(&B);
void foo(int* const A); //foo(&B);
void foo(const int* const A); //foo(&B);
#+end_src

#+RESULTS:
